Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་དགེ་བའི་རྩ་བ་དེས་ཆོས་ཐམས་ཅད་ཀྱི་རིགས་པ་རབ་ཏུ་ཤེས་ནས།
en: Due to his roots of virtue he then came to understand all of the topics of knowledge.

source: དང་པོར་བཟོ་བྱུང་བ་ཐམས་ཅད་བྱེད་དོ། །
en: First he practiced all types of craftsmanship.

source: དེས་སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་གཟུང་བའི་ཕྱིར་ཐོག་མར་ལུས་ཀྱི་ནད་རྣམས་ཀྱི་སྨན་དཔྱད་ཚེའི་རིག་བྱེད་བསྟན་ཏོ། །
en: Then, as a way of taking care of all sentient beings, he taught the science of medicine to treat their physical ailments.

source: དེའི་འོག་ཏུ་སེམས་ཅན་རྣམས་ནད་མེད་པར་བྱ་བའི་བསམ་པས་ཡོ་བྱད་བསགས་པའི་དོན་དུ་ཐ་སྙད་ཀྱི་ཆོས་ལུགས་བསྟན་ཏོ། །
en: Having formed the wish that sentient beings stay healthy, in order for them to acquire some resources, he next taught them conventional modes of prudent conduct.

source: དེའི་འོག་ཏུ་བདག་ཉིད་ཀྱི་ཡོ་བྱད་བསགས་པར་བྱ་བའི་ཕྱིར་དང་། ཡང་དག་པར་བསྲུང་བར་བྱ་བའི་ཕྱིར་འཕོང་གི་དཔྱད་བསྟན་ཏོ། །
en: Then he taught them archery so that they might gain further wealth and protect it.

source: དེའི་འོག་ཏུ་བརྩམ་པ་འགྲུབ་པར་བྱ་བའི་ཕྱིར་སྐར་མའི་ཤེས་པ་བསྟན་ཏོ། །
en: After that he taught them astrology so that their goals would be accomplished.

source: དེ་ནས་སྡུག་བསྔལ་བཟློག་པར་བྱ་བའི་ཕྱིར་དང་། བདེ་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཐར་བའི་ཤེས་པ་བསྟན་ཏོ། །
en: Finally, he taught them to understand how to become liberated so that they might overcome suffering and gain happiness.

source: སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་བསལ་བར་བྱ་བའི་དོན་དུ་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་རྣམ་པ་དུ་མ་དག་རབ་ཏུ་བསྟན་ཏོ། །
en: Thus he taught a variety of skills and crafts to eliminate sentient beings’ suffering.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གསེར་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage named Hiraṇyavatī was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གསེར་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Hiraṇyavatī.

source: ང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་ཞུགས་ནས། བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཤེས་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་བསྟན་ཏོ། །
en: Endeavoring to help all sentient beings, I taught them knowledge of every type of skill and vocation.”

source: དེ་ཚེ་གསེར་ལྡན་དྲང་སྲོང་དུ། །ང་གྱུར་དཀའ་ཐུབ་དྲག་པོ་ཡིན། །
en: “At that time, as Hiraṇyavatī the sage, I was a strict ascetic.

source: སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ལས་དེ་དག་ནི་རབ་ཏུ་བསྟན། །
en: In order to help sentient beings, I taught them various vocations.

source: དང་པོར་ཚེ་ཡི་རིག་བྱེད་དེ། །དེ་ཡི་འོག་ཏུ་འཕོང་དཔྱད་དོ། །སྐར་དཔྱད་ཟུག་རྔུ་བྱེད་པ་དང་། །གོང་དག་ཏུ་ནི་མཚན་ཉིད་དོ། །
en: “First medicine, Then archery, Astrology, the removal of sorrow, And the characteristics of each.

source: དེ་ནས་སྔོན་བྱུང་ད་ལྟར་བྱུང་། །དེ་བཞིན་དུ་ནི་མ་འོངས་དང་། །སྔོན་བྱུང་བ་དང་མ་འོངས་དང་། །ད་ལྟར་བྱུང་བ་འདི་དག་དང་། །སྒྲ་སྦྱོར་གཏམ་ནི་གྲུབ་པ་དང་། །ས་ཤེས་པ་དང་ཁམས་སྨིན་དང་། ཁྱད་པར་དུ་ནི་ཚལ་ཤེས་དང་། །ཤེས་མཆོག་འདི་དག་ཐམས་ཅད་ནི། །སེམས་ཅན་དག་ལ་ཕན་བྱ་དང་། །སེམས་ཅན་ཇི་ལྟར་བདེ་འཚོ་དང་། །སེམས་ཅན་དག་ལ་ཕན་བསམས་ནསང་ཡིས་དུས་གསུམ་ཤེས་ལ་བཀོད། །
en: “Then also the past, the present, As well as the future; What has been, what is now, And what is still to come; “And language arts, communication, Farming, the ripening of elements, And forestry— All these types of supreme knowledge “I taught sentient beings to help them, And to provide for their well-being. Out of my wish to benefit them, I helped them to know the three times.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་འཛམ་བུའི་གླིང་འདིར་དབང་ཕྱུག་རྒྱ་མཚོའི་ལྷ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in this world one named Lord Samudradeva.

source: དེ་དང་ཉེ་བ་ཞིག་ཏུ་དྲང་སྲོང་འབྲས་བུ་ཟ་བ་རྣམ་པར་གནོན་པས་འགྲོ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Nearby him there lived a sage named Vikrāntagāmin who lived off fruits.

source: དེ་ནས་དྲང་སྲོང་རྣམ་པར་གནོན་པས་འགྲོ་བ་འབྲས་བུ་འདོད་པའི་ཕྱིར་ཚལ་དུ་ཞུགས་སོ། །
en: One day Vikrāntagāmin the sage went off into the forest looking for fruit.

source: དེ་ཚལ་དེར་སོང་བ་ནས་འབྲས་བུའི་ཤིང་ཕུན་སུམ་ཚོགས་པ་འབྲས་བུ་དང་། འབྲས་བུར་ལྡན་པ་ཞིག་མཐོང་ངོ་། །
en: In the forest he found a fruit tree replete with an abundance of fruit.

source: ཤིང་དེའི་དྲུང་ན་སྦྲུལ་གདུག་པ་ཞིག་འདུག་སྟེ།
en: At the base of the tree, though, was a poisonous snake.

source: དབུགས་གདུག་པ་གཏོང་བ་རླུང་གིས་ཁྱེར་བ་ན། ཇི་ཙམ་དུ་མིག་གིས་མཐོང་བའི་བར་ཐམས་ཅད་སྲེག་གོ། །
en: It could propel venom with its breath and, once airborne, the poison would incinerate everything within its field of vision.

source: དྲང་སྲོང་དེས་སྦྲུལ་གདུག་པ་ཉལ་ཞིང་འདུག་པ་དེ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When the sage approached, the poisonous snake was fast asleep, but he thought,

source: གལ་ཏེ་སྦྲུལ་གདུག་པ་འདི་སད་ན་ཇི་ཙམ་དུ་མཐོང་བ་ཐམས་ཅད་སྲེག་གོ། །
en: ‘If this poisonous snake were to wake up, it would torch everything in sight.

source: གང་བདག་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཛམ་བུ་གླིང་གི་སྦྲུལ་གདུག་པའི་རྫིང་དེར་དོར་བར་བྱའོ་སྙམ་མོ། །
en: I’ll use my magical powers to cast it into the pond that keeps the world’s poisonous snakes.’

source: དེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྦྲུལ་གདུག་པ་དེ་དག་སྦྲུལ་གདུག་པའི་རྫིང་དེར་བོར་རོ། །
en: And so with his magical powers he hurled the poisonous snake into the pond.

source: དེ་བོར་མ་ཐག་ཏུ་སྦྲུལ་གདུག་པའི་རྫིང་དེར་ཤི་ནས། སྦྲུལ་གདུག་པ་དེ་དག་གིས་ཟོས་སོ། །
en: As soon as it landed in the pond of poisonous snakes it died and the other snakes devoured it.

source: དེ་ནས་དྲང་སྲོང་རྣམ་པར་གནོན་པས་འགྲོ་བས་སློབ་མ་རྣམས་ལ་སྨྲས་པ།
en: Then the sage Vikrāntagāmin said to his students,

source: བྲམ་ཟེའི་བུ་དག་ཇི་ཙམ་དུ་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་སྐྱེས་ཤིང་མངོན་པར་གྲུབ་སྟེ། སྡུག་བསྔལ་ཆེན་པོར་ཞུགས་པ་འདི་ལ་ལྟོས།
en: ‘Young brahmins, the more afflictions there are being formed and produced at present, the greater the suffering that is being assumed. Just look here.

source: ངས་སྦྲུལ་གདུག་པ་འདི་སྦྲུལ་གདུག་པའི་རྫིང་དུ་ཤི་བ་མཐོང་སྟེ།
en: I can see that this poisonous snake died in the pond of venomous snakes.

source: སྦྲུལ་གདུག་པ་འདི་སྔོན་མིར་གྱུར་པ་ན།
en: This poisonous snake was in fact formerly a human.

source: ད་ལྟར་བྱུང་བའི་ཉེས་པ་མི་བཟློག་ལ་ཁོན་དུ་འཛིན་པ་ཤིན་ཏུ་ཆེར་བྱེད་པའི་ཉེས་པ་དེ་འཕེལ་བར་བྱས། ཉེས་པ་དེ་སྤྱོད་ཅིང་འདུག་གོ། །
en: He did nothing to counteract his faults, and so he incurred the fault of hatred, which escalated and now he suffers from that very same fault.’

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་ད་ལྟར་བྱུང་བའི་ཉེས་པ་བཟློག་པར་བྱའོ། །
en: “Therefore, Maudgalyāyana, one must counteract one’s present faults.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་ལོག་པར་ལྟུང་བ་དེ་དག་ཐམས་ཅད་ནི་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་མ་བཟློག་པ་ཡིན།
en: All the misfortune that sentient beings fall into happens because they have done nothing to counteract their afflictions in the present.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་འདས་པའི་དུས་ན་སྡུག་བསྔལ་མྱོང་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་མ་བཟློག་པ་ཡིན་ནོ། །
en: All the suffering they underwent in the past happened because of doing nothing to counteract those present afflictions.

source: དེ་ལྟར་འདས་པའི་དུས་སུ་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དེ་དག་སྡུག་བསྔལ་མྱོང་བར་གྱུར་ཏོ། །
en: In just the same way, mendicants and brahmins have gone through suffering in the past.

source: སེམས་ཅན་གང་དག་འདས་པའི་དུས་ན་ད་ལྟར་བྱུང་བའི་ཕྱོགས་དཀར་པོ་འཕེལ་བར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རྐྱེན་གྱིས་འདས་པའི་དུས་སུ་བདེ་བ་མྱོང་ངོ་། །
en: Those sentient beings who experienced happiness in the past did so as a result of the contemporaneous positivity they fostered in the past.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་མ་འོངས་པའི་དུས་ན་བདེ་བ་མྱོང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་ཕྱོགས་དཀར་པོ་འཕེལ་བར་བྱས་པས་མ་འོངས་པའི་དུས་སུ་བདེ་བ་མྱོང་བར་འགྱུར་རོ། །
en: Whatever happiness sentient beings will experience in the future—it is all due to fostering positivity in the present that one experiences happiness in the future.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་ད་ལྟར་བྱུང་བའི་དུས་སུ་སྡུག་བསྔལ་མྱོང་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་མ་བཟློག་པ་ཡིན་ནོ། །
en: Whatever suffering sentient beings undergo in the present, it all occurs because they do nothing to counteract their present afflictions.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་ད་ལྟར་བྱུང་བའི་དུས་སུ་བདེ་བ་མྱོང་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་བཟློག་པ་ཡིན་ནོ། །
en: Whatever happiness sentient beings experience in the present, it all occurs because they counteract their present afflictions.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་སྤང་བ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, one must train in eliminating one’s present afflictions.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། །
en: Maudgalyāyana, those noble sons and daughters who are well grounded in the vehicle of the bodhisattvas should train in this way.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་འདས་པའི་དུས་ན་བདེ་བ་མྱོང་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་དགེ་བའི་ཆོས་ཡང་དག་པར་སྤེལ་བ་ཡིན།
en: Whatever happiness sentient beings experienced in the past, it all occurred due to the good qualities they fostered in that moment.

source: སེམས་ཅན་གང་དག་ཇི་ཙམ་དུ་མ་འོངས་པའི་དུས་ན་བདེ་བ་མྱོང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་དགེ་བའི་ཕྱོགས་ཡང་དག་པར་སྤེལ་བ་ཡིན་སེམས་ཅན་གང་དག་དེ་ལྟར་ན་ད་ལྟར་བྱུང་བའི་དུས་སུ་བདེ་བ་མྱོང་བ་དེ་དག་ཐམས་ཅད་ད་ལྟར་བྱུང་བའི་དགེ་བའི་ཆོས་དག་ཡང་དག་པར་སྤེལ་བའི་རྒྱུ་ཡིན་ཏེ
en: Whatever happiness sentient beings will experience in the future, it will occur due to the good qualities they foster in that moment. And just the same, whatever happiness sentient beings experience in the present, it is all caused by the good qualities they foster in the present.

source: ད་ལྟར་བྱུང་བ་ན་ཡང་ད་ལྟར་བདེ་བ་མྱོང་ངོ་། །
en: Even right now in the present, they immediately experience happiness.

source: དེ་ལྟར་ན་ད་ལྟར་བྱུང་བའི་སྡུག་བསྔལ་གྱི་རྒྱུ་ནི་འདི་ལྟ་སྟེ། ད་ལྟར་བྱུང་བའི་རྒྱུ་ཡིན་ནོ། །
en: “Accordingly, the cause of present suffering lies in the cause of the present.

source: དེ་ལྟ་བས་ན་ཆོས་གང་གིས་རྒྱུ་བྱས་ཤེས་ཆོས་དེ་བརྟག་པར་བྱ་སྟེ།
en: Thus, one must understand and analyze anything that functions as such a cause.

source: མི་དགེ་བའི་ཕྱོགས་ཀྱི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་ནི་བརྟགས་པའི་རྒྱུ་ཉིད་ཅེས་བྱའོ། །
en: Through the thorough comprehension of non-virtue we arrive at what is called the imputed cause ,

source: དགེ་བའི་ཕྱོགས་ལ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་ནི་བྱས་པའི་རྒྱུ་ཞེས་བྱ་སྟེ།
en: while proper mental engagement with virtue is known as the enacted cause.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདའ་བའི་རྒྱུ་ནི་དེ་དག་ཡིན་ནོ། །
en: These make up the causes of cyclic existence and nirvāṇa.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་འཁོར་བའི་རྒྱུ་བཟློག་པར་བྱ་ཞིང་། མྱ་ངན་ལས་འདས་པའི་རྒྱུ་ཡང་དག་པར་སྤེལ་བར་བྱའོ། །
en: Bodhisattvas must counteract the causes of cyclic existence and foster the causes of nirvāṇa.

source: མཽད་གལ་གྱི་བུ་ངས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དག་མངོན་པར་འདུས་བྱས་པ་ནི་
en: “Maudgalyāyana, I formed numerous roots of virtue for the purpose of understanding the paths that lead to all destinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་སྒྱུ་མ་མཁན་སྒྱུ་མའི་བཟོ་ལ་ཤིན་ཏུ་བསླབ་པ་བཟོ་སྣ་ཚོགས་སྩོགས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a magician named Gatherer of Myriad Creations who was well versed in magical creations.

source: དེ་སྐྱེ་བོའི་ཚོགས་མང་པོའི་མདུན་དུ་སྒྱུ་མའི་བཟོ་རྣམ་པ་སྣ་ཚོགས་དག་སྟོན་ཏེ། བར་བར་ནི་གླང་པོ་ཆེའི་གཟུགས། བར་བར་ནི་རྟའི་གཟུགས། བར་བར་ནི་ཁྱུ་མཆོག་གི་གཟུགས། བར་བར་ནི་མི་དག་གི་གཟུགས་ཏེ། འདིའི་རྣམ་པ་སུས་ཀྱང་མི་ཤེས་སོ། །
en: He exhibited a variety of magical creations in front of large audiences, whether it was the forms of elephants, horses, bulls, or persons. There was no one who caught on to his tricks.

source: དེའི་ཚེ་དེའི་དུས་ན། སྒྱུ་མ་མཁན་དུ་གྱུར་པ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the magician was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། སྒྱུ་མ་མཁན་དུ་གྱུར་ཏོ། །
en: In those days I was the magician.

source: ངས་དེའི་ཚེ་ཡང་སེམས་ཅན་རྣམས་ལ་སྒྱུ་མ་རྣམ་པ་སྣ་ཚོགས་བསྟན་ཏེ། ད་ལྟར་ཡང་སེམས་ཅན་རྣམས་ལ་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུའོ་ཞེས་སྟོན་ཏོ། །
en: In those days I performed numerous magical illusions for sentient beings, just like now I teach beings that everything is like a magical illusion.

source: ཇི་ལྟར་སྒྱུ་མ་མཁན་སྒྱུ་མ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པ་དེ་ལྟར་ཡོངས་སུ་ཤེས་པ་རྣམ་པར་ཤེས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལམ་རྟོགས་པར་བྱེད་དེ། ཡོངས་སུ་ཤེས་པའི་སེམས་ཀྱིས་ཀྱང་མྱ་ངན་ལས་འདས་པའི་ལམ་རྣམ་པར་སྦྱོང་བར་བྱེད་དོ། །
en: Just as a magician performs a variety of magical illusions, I cause the perception of others to realize the paths that lead to all destinations, and in their perception I make them train on the path to nirvāṇa.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་ཡོངས་སུ་ཤེས་པ་ལ་བྱང་ཆུབ་སེམས་དཔས་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should train in such perceptions.

source: མཽད་གལ་གྱི་བུ་ངས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུས་བྱས་པ་ནི་
en: “Maudgalyāyana, I created innumerable roots of virtue in order to gain knowledge of the origin as related to knowledge of the paths that lead to all destinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། གཙོ་བོའི་བུ་ཙན་དན་ཞེས་བྱ་བ་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དད་པ་གཞལ་དུ་མེད་པ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ལ་དགའ་བ་གཞལ་དུ་མེད་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world one named Sandalwood Heir who had served past victors, and who had limitless faith in as well as limitless fondness for the Thus-Gone One.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་མཁྱེན་པའི་དོན་དུ་དེ་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་འགོག་པའི་ཆོས་ཅན་དུ་མཐོང་སྟེ། དེ་འདི་སྙམ་དུ་གྱུར་ཏོ། །
en: He saw that in order to attain the buddhas’ wisdom, the paths that lead to all destinations must cease.

source: འཕགས་པའི་ཤེས་པས་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ལ། ཤེས་པ་གཞན་ལ་ཡང་གནས་པར་མི་བྱའོ། །
en: He thought to himself, ‘Complete awakening to buddhahood does not take place through the knowledge of the noble ones, nor can it happen on the basis of any other knowledge.

source: དངོས་པོར་འཛིན་པ་ཉིད་དེ། འདི་ལྟ་སྟེ། ལམ་ལ་འཛིན་པའམ། མྱ་ངན་ལས་འདས་པ་ལ་འཛིན་པའོ། །
en: It is because such knowledge grasps to something as being real, whether that grasping is to the path, or to nirvāṇa.

source: དངོས་པོ་ཅུང་ཟད་ཀྱང་མི་འཛིན་པ་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་ཏེ།
en: Complete awakening to buddhahood can only take place when there is no longer the slightest bit of grasping to anything as real.

source: དེ་ལྟ་བས་ན་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ། །
en: Thus, one must not fixate on knowledge of the paths that lead to all destinations.

source: འདི་ལྟ་སྟེ་དཔེར་ན་གཟིངས་ལ་བརྟེན་ཏེ། ཕ་རོལ་ཏུ་ཕྱིན་ནས་གཟིངས་དོར་བར་བྱའོ། །
en: It is like the analogy of traveling in a boat: once you reach the other shore, you leave the boat behind.

source: དེ་བཞིན་དུ་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་དོར་བར་བྱའོ། །
en: In the same way, after attaining complete awakening, you must leave behind the knowledge of the paths that lead to all destinations.

source: ཇི་ལྟར་འཛིན་པ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བར་བལྟ་བ་དེ་ལྟར་མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་གྱིས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་དོར་བར་བྱ་སྟེ
en: As we must, without clinging, regard all phenomena as lacking a concrete essence, so too we must, without any observation, give up knowledge of the paths that lead to all destinations.

source: དེ་ལྟར་ན་ཆོས་རྣམས་གཟིངས་ལྟ་བུར་ཡོངས་སུ་མཐོང་བར་འགྱུར་རོ། །
en: In this sense we should regard the teachings as like a boat.’

source: དེའི་ཚེ་དེའི་དུས་ན། གཙོ་བོའི་བུ་ཙན་དན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time Sandalwood Heir was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་གཙོ་བོའི་བུ་ཙན་དན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Sandalwood Heir.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དངོས་པོ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ། །
en: Thus, Maudgalyāyana, bodhisattvas should have no observation of anything.

source: མཽད་གལ་གྱི་བུ་ངས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Maudgalyāyana, I created countless roots of virtue for the sake of gaining knowledge of cessation as related to knowledge of the paths that lead to all destinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲི་ཟ་སྐྱེ་བོ་ཀུན་གྱིས་རྟོགས་པ་ཞེས་བྱ་བ་པི་བང་གི་རྒྱུད་ཀྱི་ཤེས་པ་ལ་ཤིན་ཏུ་མཁས་པ་ཞིག་བྱུང་ངོ་། །
en: Long ago, Maudgalyāyana, long before even the distant past there was a gandharva named Realized by All Beings. He was incredibly skilled at the lute—

source: པི་བང་གི་རྒྱུད་གཅིག་ལས་ཀྱང་རོལ་མོའི་སྒྲ་དང་། པི་བང་རྒྱུད་གཅིག་པ་དང་། པི་བང་དང་། ན་ཀུ་ལ་དང་། ཤིན་ཏུ་དབྱངས་སྙན་དང་། སིལ་སྙན་དང་། ཅང་ཏེའུ་དང་། དེ་བཞིན་དུ་རོལ་མོའི་སྒྲ་བྱེ་བ་ཕྲག་དག་པི་བང་གཅིག་ལས་བྱུང་སྟེ
en: in fact just by plucking one string of his lute he could make it sound like a flute, a lute, a nakula , a beautiful voice, cymbals, a drum, or the sound of ten million other instruments.

source: དེ་བཞིན་དུ་སྡེབ་སྦྱོར་དག་ཤིན་ཏུ་བྱུང་། དེ་བཞིན་དུ་རྒྱན་དག་ཤིན་ཏུ་བྱུང་། དེ་བཞིན་དུ་པི་བང་གི་རྒྱུད་དག་ཤིན་ཏུ་བྱུང་སྟེ།
en: He was similarly skilled in lyrical composition and embellishment, not to mention at playing the lute itself.

source: དེ་སྐྱེ་བོའི་ཚོགས་མང་པོའི་མདུན་དུ་པི་བང་གང་དང་གང་གི་རྣམ་པ་བརྩམས་པ་དེས་སྐྱེ་བོ་དེ་དག་ཉིད་དགའ་བར་བྱེད་དེ།
en: He performed before large audiences, and no matter what he played, the audience loved it.

source: པི་བང་དེའི་ཉེས་པའི་བར་ཆད་གང་ཡང་མེད་ཅིང་། པི་བང་གང་དང་གང་གི་སྒྲ་བླངས་པ་དེ་དང་དེ་ཉིད་ཀྱིས་སྐྱེ་བོ་དགའ་བར་བྱེད་དོ། །
en: His lute never malfunctioned, and he was able to delight his audience with every song he played.

source: ཇི་ལྟར་འདིར་པི་བང་གི་བཟོ་ལ་ཤིན་ཏུ་བསླབས་པ་དེ་གཅིག་བུ་དབེན་པར་སོང་ནས་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: As much of an expert as he had become in the art of lute-playing, he found himself going off to a solitary place and reflecting,

source: ཀྱེ་ཨེ་མ་སེམས་ཅན་འདི་དག་ནི་པི་བང་གི་སྒྲ་འདིས་བསླུས་ཏེ།
en: ‘Alas! How beguiled these beings are by the sound of my lute!

source: གང་སྒྲ་འདི་འགོག་པའི་ཆོས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མི་ཤེས་སོ། །
en: And yet they fail to understand that such a sound is transient.

source: དེ་ལ་སྣང་བ་ཤེས་ཤིང་མཐོང་བ་མངོན་པར་རྟོགས་པ་ཐམས་ཅད་ནི་འཕགས་པ་ཞེས་བྱ་སྟེ།
en: Those who understand appearances and realize all that can be seen are called “noble ones.”

source: འདི་ལྟར་ཀུན་རྫོབ་ཙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཡིན་ནོ། །
en: Just to come to a correct understanding of this on a relative level is to achieve acceptance that phenomena are unborn.’

source: བཟོད་པ་དེ་ཐོབ་པས་སེམས་ཅན་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ལ་བཙུད་པར་འགྱུར་རོ། །
en: Achieving such acceptance himself, he went on to lead untold hundreds of billions of beings to the irreversible stage.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་དྲི་ཟ་སྐྱེ་བོ་ཀུན་གྱིས་རྟོགས་པ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the gandharva named Realized by All Beings was anyone else, do not think so.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ང་དེའི་ཚེ་དེའི་དུས་ན་དྲི་ཟ་སྐྱེ་བོ་ཀུན་གྱིས་རྟོགས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Why? Because in those days I was the gandharva named Realized by All Beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས།
en: Therefore, Maudgalyāyana, bodhisattva great beings should think as follows:

source: ཀྱེ་མ་པི་བང་གི་སྒྲ་འདི་དག་ཐམས་ཅད་ནི་འགོག་པའི་ཆོས་ཅན་ཏེ།
en: ‘Alas, the sound of a lute is entirely transitory.

source: དེ་འབྱུང་བ་ན་གང་ནས་ཀྱང་མི་འོང་ཞིང་འགོག་པ་ན་གར་ཡང་མི་འགྲོའོ། །
en: As it arises, it does not come from anywhere nor, as it ceases, does it go anywhere.

source: དེ་ལ་ཀུན་རྫོབ་ཏུ་སྐྱེ་བ་དང་། འགག་པར་འགྱུར་ལ་ཆོས་དེ་ངོ་བོ་ཉིད་ཀྱིས་གང་ཡང་དམིགས་སུ་མེད་དོ། །
en: While on a relative level it can be said to begin and end, fundamentally it is not anything that can be apprehended.

source: གང་ངོ་བོ་ཉིད་སྐྱེ་བའམ་འགག་པ་དེ་ཀུན་རྫོབ་ཙམ་དུ་འགགས་ཞེས་བྱའོ། །
en: Anything whose nature is to originate and cease, such cessation is said to be merely on a relative level.’

source: སྦྱོར་བའི་རྣལ་འབྱོར་ལ་མཁས་པར་བྱ་སྟེ།
en: One should become skilled in the practice of engagement.

source: སྦྱོར་བའི་རྣལ་འབྱོར་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལས་ནམས་ཀྱང་ཉམས་པར་མི་འགྱུར་རོ། །
en: Those bodhisattvas who are skilled in the practice of engagement will never fall from the path of omniscience.

source: མཽད་གལ་གྱི་བུ་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva, I created countless roots of virtue for the sake of gaining knowledge of the path that leads to cessation as related to knowledge of the paths that lead to all destinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དཔག་མེད་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Unfathomable Banner.

source: དེའི་ཚེ་འཛམ་བུ་གླིང་འདིར་གྲོང་ཁྱེར་བྱེ་བ་ཕྲག་དྲུག་བྱུང་ངོ་། །
en: In that era, the world had six hundred million cities.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་དཔག་ཚད་ཁྲི་ཕྲག་བཞིར་གྱུར་ཏེ་ལག་མཐིལ་ལྟར་མཉམ་ཞིང་སྡོང་དུ་མ་དང་། ཚེར་མ་མེད་ལ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཐམས་ཅད་དང་ལྡན་ཞིང་ཉེས་པ་ཐམས་ཅད་དང་བྲལ་བར་གྱུར་ཏོ། །
en: The world was forty thousand leagues wide and flat as the palm of a hand, and there were many trees but none of them had thorns. It had everything that this present Sahā world does, except that it was free of any defects.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མུན་པ་འཇོམས་པ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: At that time there appeared in the world a thus-gone, worthy, perfect buddha named Defeater of Darkness; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་མུན་པ་འཇོམས་པ་ཞེས་བྱ་བ་དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་དྲུག་ཅུར་གྱུར་ཏོ། །
en: The thus-gone Defeater of Darkness lived to be six hundred trillion years old.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནད་ཉུང་ཞིང་གནོད་པ་ཉུང་བར་གྱུར་ཏེ།
en: It happened that at that time in his buddhafield, every sentient being that was born suffered sickness and ailments.

source: སེམས་ཅན་གང་ཡང་ན་བར་མ་གྱུར་ཅིང་སེམས་ཅན་དེ་དག་འཆི་བའི་མཐའི་ནད་ཀྱིས་མིའི་དུས་ལས་འདས་པ་ནི་མ་གཏོགས་ཏེ། ཕུང་པོའི་ལྷག་མ་དང་བཅས་པའི་དུས་བྱས་ནས་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེའོ། །
en: Besides those beings who remained healthy, and those who eventually died of natural causes at the end of their human life, the others died along with their physical aggregates and were reborn with the same fortune as the gods of Making Use of Others’ Emanations.

source: གཞན་དུ་ན་སེམས་ཅན་དེ་དག་ལས་གང་ཕལ་ཆེར་སྨོན་ལམ་གྱི་དབང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་སྟེ།
en: Due to their aspirations, moreover, the majority of those beings were irreversible from unexcelled and perfect awakening.

source: དེ་འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་དུ་མར་སོང་ཞིང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Those who so desired traveled to various realms, only one life away from fully awakening to unexcelled and perfect buddhahood.
